Repository: engibrahim4u/StaffMembersRepo
Catalog: WebApp/WebApp/Resources/Views/Shared/_LoginPartial.*.resx
Languages: ar_eg

source: About Center
ar_eg: عن المركز

source: Activities
ar_eg: الأنشطة والفعاليات

source: Activity
ar_eg: النشاط والفعالية

source: Add User
ar_eg: اضافة مستخدم

source: Administrations
ar_eg: الإدارات

source: Advisory Board
ar_eg: الهيئة الإستشارية

source: All Instructors
ar_eg: قائمة المحاضرين

source: Change Password
ar_eg: تغيير كلمة المرور

source: Computer Administration
ar_eg: إدارة الحاسب الألي

source: Configuration
ar_eg: التهيئة

source: Confirmed Registered Groups
ar_eg: المتدربين المؤكد حجزهم

source: Consulting and Research Administration
ar_eg: إدارة الاستشارات والبحوث

source: Contact Us
ar_eg: اتصل بنا

source: Course Files
ar_eg: ملفات المقررات

source: Course Group Instructors
ar_eg: المحاضرين للدورات

source: Course Groups
ar_eg: المجموعات

source: Course Price
ar_eg: رسوم المقررات

source: Course Register
ar_eg: تسجيل دورة

source: Course Types
ar_eg: تصنيف الدورات

source: Course Units
ar_eg: الوحدات

source: Courses
ar_eg: الدورات التدريبية

source: Editorial Board
ar_eg: هيئة التحرير

source: Editorial Head
ar_eg: رئيس التحرير

source: Events
ar_eg: الأحداث

source: Faculty Users
ar_eg: مستخدمي الكليات

source: Financial Affairs Administration
ar_eg: إدارة الشئون المالية

source: Home
ar_eg: الرئيسية

source: Instructor
ar_eg: المحاضر

source: Instructor Courses
ar_eg: مقررات المحاضرون

source: Instructors
ar_eg: المحاضرين

source: Issues
ar_eg: الإصدارات

source: Login
ar_eg: تسجيل الدخول

source: Main Menu
ar_eg: القائمة الرئيسية

source: Management
ar_eg: ادارة

source: Material Types
ar_eg: انواع الملفات المرفوعة

source: Message Replay
ar_eg: الرد على الاستفسارات

source: Messages Settings
ar_eg: إعدادات الرسائل

source: Mission
ar_eg: الرسالة

source: My Courses
ar_eg: دوراتي

source: News
ar_eg: الأخبار

source: Objectives
ar_eg: الأهداف

source: Organizational Chart
ar_eg: الهيكل التنظيمي

source: Passed Trainees
ar_eg: اجتياز الإختبارات

source: Payed
ar_eg: المدفوعات

source: Payment List
ar_eg: قائمة التحصيل

source: Payments
ar_eg: الرسوم

source: Performance Appraisal Administration
ar_eg: إدارة تقييم الأداء

source: Personal Data
ar_eg: البيانات الشخصية

source: Profile
ar_eg: الملف الشخصي

source: Publish Areas
ar_eg: مجالات النشر

source: Publish Chapters
ar_eg: أبواب النشر

source: Receive Payment
ar_eg: تحصيل الرسوم

source: Register
ar_eg: تسجيل جديد

source: Register Coures
ar_eg: حجز دورة

source: Registered Groups
ar_eg: المتدربين الحاجزين لدورات

source: Reports
ar_eg: التقارير

source: Reservation
ar_eg: الحجز

source: Reset User Password
ar_eg: تعيير كلمة مرور مستخدم

source: Roles
ar_eg: الصلاحيات

source: Search
ar_eg: بحث

source: Search Site Users
ar_eg: بحث عن مستخدمي النظام

source: Search Student Request
ar_eg: بحث عن حالة الطلب للطالب

source: Settings
ar_eg: الاعدادات

source: Signout
ar_eg: تسجيل الخروج

source: Site Settings
ar_eg: اعدادات الموقع

source: Strategic Studies Administration
ar_eg: إدارة الدراسات الإستراتيجية

source: Study Courses
ar_eg: المقررات الدراسية

source: Study Levels
ar_eg: الفرق الدراسية

source: Subscriptions
ar_eg: الاشتراكات

source: Trainees
ar_eg: المتدربين

source: Trainees Count
ar_eg: أعداد المتدربين

source: Trainees List
ar_eg: قائمة المتدربين

source: Training Administration
ar_eg: إدارة التدريب

source: Training Courses
ar_eg: الدورات التدريبية

source: Trainning Courses
ar_eg: الدورات التدريبية

source: Update Email
ar_eg: تعديل الايميل

source: Update Mobile
ar_eg: تعديل المحمول

source: Update National ID
ar_eg: تعديل الرقم القومي

source: Update Personal Data
ar_eg: تعديل البيانات الشخصية

source: Users
ar_eg: مستخدمي النظام

source: Users Management
ar_eg: إدارة المستخدمين

source: Users Managements
ar_eg: إدارة المستخدمين

source: Video and Live
ar_eg: البث المباشر والفيديو

source: Vission
ar_eg: الرؤية

source: عربي
ar_eg: EN
