Repository: engibrahim4u/StaffMembersRepo
Catalog: WebApp/WebApp/Resources/Models/ViewModels/RegisterVM.*.resx
Languages: ar_eg

source: Academic Degree
ar_eg: الدرجة العلمية

source: Arabic and English Characters Only (3-250)
ar_eg: حرف عربي وانجليزي فقط من 3-250 حرف

source: Arabic and English Characters Only (5-250)
ar_eg: حرف عربي وانجليزي فقط من 5-250 حرف

source: Arabic and English Charcters Only (2-25)
ar_eg: حرف عربي وانجليزي فقط من 2-25 حرف

source: Arabic Letters Only (8-150)
ar_eg: حروف عربي فقط

source: Author Instructions
ar_eg: شروظ ان تكون باحث

source: Bank City
ar_eg: المدينة

source: Bank Name
ar_eg: اسم البنك

source: Branch Code
ar_eg: رقم الفرع

source: Confirm Password
ar_eg: تأكيد كلمة المرور

source: Country
ar_eg: البلد

source: Email
ar_eg: البريد الإلكتروني

source: Family Name
ar_eg: اسم العائلة

source: Father Name
ar_eg: اسم الأب

source: First Name
ar_eg: الاسم الأول

source: From 10 to 100 Characters
ar_eg: النص المدخل لا يقل عن 10 احرف ولايزيد عن 100 حرف

source: Full Name
ar_eg: الاسم

source: General Specialization
ar_eg: التخصص العام

source: Grand Father Name
ar_eg: اسم الجد

source: IBAN
ar_eg: الأيبان (IBAN)

source: Input Error
ar_eg: ادخال خاطئ

source: Invalid Username or Password
ar_eg: خطا في اسم المستخدم او كلمة المرور

source: Journal
ar_eg: المجلة

source: Language
ar_eg: لغة المراسلة

source: Like(POB 123456 Town Name 123456)
ar_eg: مثال (ص.ب 123456 المدينة 123456)

source: Mobile
ar_eg: الجوال

source: Name
ar_eg: الاسم ثلاثي او رباعي

source: Name in Arabic or English
ar_eg: كلمات عربي أو انجليزي

source: Name In Bank(Arabic)
ar_eg: الاسم في البنك باللغة العربية

source: Name In Bank(English)
ar_eg: الاسم في البنك باللغة الانجليزية

source: Name must be at least three words English or Arabic Characters
ar_eg: الاسم ثلاثي و رباعي حروف عربي او انجليزي فقط

source: Name must be English Characters
ar_eg: الاسم باللغة الانجليزية بالبنك

source: Not Email Address
ar_eg: ليس بريد إلكتروني

source: Numbers and English Characters Only (5-50)
ar_eg: حروف انجليزي وارقام فقط

source: Password
ar_eg: كلمة المرور

source: Password and Confirm Password not Same
ar_eg: كلمة المرور غير متطابقة

source: Password contain 8-12 English Characters and digits and special Characters like @$_.%#&amp;
ar_eg: كلمة المرور تتكون من 8 الي 12 حروف او ارقام او احد الحروف الخاصة @$_.%#& فقط

source: Password contain English Characters and digits and special Characters like @$_.%#&amp;
ar_eg: كلمة المرور تتكون من 6 الي 12 حروف او ارقام او احد الحروف الخاصة @$_.%#& فقط

source: Passwords must have at least one lowercase ('a'-'z').
ar_eg: كلمة المور يجب ان تحتوي حرف صغير a-z

source: POB
ar_eg: صندوق البريد

source: Registraion Type
ar_eg: نوع التسجيل

source: Required
ar_eg: مطلوب

source: Reviewer Instructions
ar_eg: شروط ان تكون محكم

source: Scientific Level
ar_eg: المستوى العلمي

source: Specialization
ar_eg: التخصص الدقيق

source: Study Level
ar_eg: المرحلة الدراسية

source: Swift Code
ar_eg: السويف كود للبنك

source: Text must not more than 50 Characters
ar_eg: النص المدخل لايزيد عن 50 حرف

source: University
ar_eg: جهة العمل
